<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot), Modified for Page Search</string>
	<key>Description</key>
	<string>Downloads the latest version of Sim Life Firestorm Client.</string>
	<key>Identifier</key>
	<string>com.github.baddmann.download.Firestorm</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>FirestormOS-Releasex64</string>
		<key>DOWNLOAD_URL</key>
		<string>http://www.firestormviewer.org/mac/</string>
		<key>NAME</key>
		<string>Firestorm</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
	    <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <!-- More specific than http://audacityteam.org, which shows Windows links by default -->
                <key>re_pattern</key>
                <string>(?P&lt;first_url&gt;http.*?dmg)</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%first_url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
